#+TITLE: Exercises
#+AUTHOR: Mario Román
#+EMAIL: mromang08@gmail.com
#+OPTIONS: num:nil toc:nil
#+LANGUAGE: es
#+STARTUP: indent

#+LaTeX: \setcounter{secnumdepth}{0}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage{tikz-cd}
#+latex_header: \newtheorem{theorem}{Teorema}
#+latex_header: \newtheorem{fact}{Proposición}
#+latex_header: \newtheorem{definition}{Definición}
#+latex_header: \newenvironment{statement}{\noindent\rule[0.5ex]{\linewidth}{1pt}\begin{em}}{\end{em}\newline\noindent\rule[0.5ex]{\linewidth}{1pt}}
#+latex_header: \setlength{\parindent}{0pt}

*** Ejercicio 2.16
 Tenemos una extensión sobre $\mathbb{F}_2$ generada por un polinomio de grado 3. 
 Sus elementos son clases de equivalencia sobre polinomios de hasta 
 grado dos, habiendo 8 elementos. Abusando de la notación, los escribimos como
 los representantes de su clase de equivalencia:

 \[\{0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1\}\]

 Tenemos las siguientes tablas para la suma y el producto:

 #+BEGIN_SRC sage :exports none
 R.<t> = PolynomialRing(GF(2),'t')
 I = R.ideal(t^3+t+1)
 S.<x> = R.quotient_ring(I)
 #+END_SRC
 #+RESULTS:

 #+BEGIN_SRC sage :exports results
 S.addition_table(
     names=["0","1","x","x+1","x^2","x^2+1","x^2+x","x^2+x+1"],
     elements=[0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1]
 )
 #+END_SRC
 #+RESULTS:
 #+begin_example

       +        0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
	+----------------------------------------------------------------
       0|       0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
       1|       1       0     x+1       x   x^2+1     x^2 x^2+x+1   x^2+x
       x|       x     x+1       0       1   x^2+x x^2+x+1     x^2   x^2+1
     x+1|     x+1       x       1       0 x^2+x+1   x^2+x   x^2+1     x^2
     x^2|     x^2   x^2+1   x^2+x x^2+x+1       0       1       x     x+1
   x^2+1|   x^2+1     x^2 x^2+x+1   x^2+x       1       0     x+1       x
   x^2+x|   x^2+x x^2+x+1     x^2   x^2+1       x     x+1       0       1
 x^2+x+1| x^2+x+1   x^2+x   x^2+1     x^2     x+1       x       1       0
 #+end_example

 #+BEGIN_SRC sage :exports results
 S.multiplication_table(
     names=["0","1","x","x+1","x^2","x^2+1","x^2+x","x^2+x+1"],
     elements=[0,1,x,x+1,x^2,x^2+1,x^2+x,x^2+x+1]
 )
 #+END_SRC
 #+RESULTS:
 #+begin_example

       *        0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
	+----------------------------------------------------------------
       0|       0       0       0       0       0       0       0       0
       1|       0       1       x     x+1     x^2   x^2+1   x^2+x x^2+x+1
       x|       0       x     x^2   x^2+x     x+1       1 x^2+x+1   x^2+1
     x+1|       0     x+1   x^2+x   x^2+1 x^2+x+1     x^2       1       x
     x^2|       0     x^2     x+1 x^2+x+1   x^2+x       x   x^2+1       1
   x^2+1|       0   x^2+1       1     x^2       x x^2+x+1     x+1   x^2+x
   x^2+x|       0   x^2+x x^2+x+1       1   x^2+1     x+1       x     x^2
 x^2+x+1|       0 x^2+x+1   x^2+1       x       1   x^2+x     x^2     x+1
 #+end_example

**** Punto 2
 Tenemos a $1,\sqrt{2},\sqrt{3},\sqrt{5},\sqrt{6},\sqrt{10},\sqrt{15},\sqrt{30}$ sistema de generadores del espacio,
 y por ser de dimensión $8$, sabemos que forman una base. Veamos que $1,\alpha,\alpha^2,\dots,\alpha^7$ es una base 
 del mismo espacio comprobando independencia lineal sobre la base inicial.

 #+BEGIN_SRC sage :exports none
   A = FreeAlgebra(QQ,3,'i')
   F = A.monoid()
   a,b,c = F.gens()
   mons = [ F(1), a,b,c,a*b,a*c,b*c,a*b*c ]
   M = MatrixSpace(QQ,len(mons))
   mats = [
       M([0,1,0,0,0,0,0,0,
          2,0,0,0,0,0,0,0,
          0,0,0,0,1,0,0,0,
          0,0,0,0,0,1,0,0,
          0,0,2,0,0,0,0,0,
          0,0,0,2,0,0,0,0,
          0,0,0,0,0,0,0,1,
          0,0,0,0,0,0,2,0
       ]),
       M([0,0,1,0,0,0,0,0,
          0,0,0,0,1,0,0,0,
          3,0,0,0,0,0,0,0,
          0,0,0,0,0,0,1,0,
          0,3,0,0,0,0,0,0,
          0,0,0,0,0,0,0,1,
          0,0,0,3,0,0,0,0,
          0,0,0,0,0,3,0,0
       ]),
       M([0,0,0,1,0,0,0,0,
          0,0,0,0,0,1,0,0,
          0,0,0,0,0,0,1,0,
          5,0,0,0,0,0,0,0,
          0,0,0,0,0,0,0,1,
          0,5,0,0,0,0,0,0,
          0,0,5,0,0,0,0,0,
          0,0,0,0,5,0,0,0
       ])
   ]
   P3.<a,b,c> = A.quotient(mons,mats)
 #+END_SRC

 #+RESULTS:

 Para ello escribo los coeficientes de cada $\alpha^n$ en la
 base inicial formando la siguiente matriz y compruebo que son linealmente independientes.

 #+BEGIN_SRC sage :exports results
 M = matrix([ ((a+b+c)^n).vector() for n in range(0,8) ]).transpose()
 M
 #+END_SRC

 #+RESULTS:
 : 
 : [    1     0    10     0   224     0  6160     0]
 : [    0     1     0    26     0   784     0 23024]
 : [    0     1     0    24     0   664     0 18976]
 : [    0     1     0    20     0   520     0 14720]
 : [    0     0     2     0    80     0  2448     0]
 : [    0     0     2     0    64     0  1904     0]
 : [    0     0     2     0    56     0  1584     0]
 : [    0     0     0     6     0   200     0  5936]

 Si calculamos el rango de esta matriz, obtenemos que es invertible.

 #+BEGIN_SRC sage :exports both
 M.rank()
 #+END_SRC

 #+RESULTS:
 : 8

**** Punto 3
 Usando la matriz anterior, obtengo un polinomio que tiene por raíz
 a $\sqrt{2}+\sqrt{3}+\sqrt{5}$. Para ello escribo los coeficientes de $\alpha^8$ en
 función de la base anterior de la matriz.

 #+BEGIN_SRC sage :exports both
 M.solve_right(vector(QQ,((a+b+c)^8).vector()))
 #+END_SRC

 #+RESULTS:
 : (-576, 0, 960, 0, -352, 0, 40, 0)

 Así que tengo el polinomio siguiente del que $\alpha$ es raíz:

 \[t^8-40*t^6+352*t^4-960*t^2+576\]

 # Checking the answer
 #+BEGIN_SRC sage :exports none
 t = sqrt(2)+sqrt(3)+sqrt(5)
 (-40*t^6+352*t^4-960*t^2+576+t^8).expand()
 #+END_SRC

 #+RESULTS:
 : 0

*** Anillos básicos
#+BEGIN_SRC sage
  ZZ in Fields
  ZZ in EuclideanDomains
#+END_SRC

#+RESULTS:
: False
: True

**** Extensiones algebraicas
 #+BEGIN_SRC sage
 K = NumberField(x^2+1, 's')
 OK = K.ring_of_integers()
 OK
 SS = NumberField(x^2-5,'s').ring_of_integers()
 SS.0
 SS
 #+END_SRC

 #+RESULTS:
 : Gaussian Integers in Number Field in s with defining polynomial x^2 + 1
 : 1/2*s + 1/2
 : Maximal Order in Number Field in s with defining polynomial x^2 - 5

**** Anillos de enteros módulo n
 #+BEGIN_SRC sage
 Z7 = Integers(7)
 Z7.is_field()
 Z8 = Integers(8)
 Z8.cardinality()
 #+END_SRC

 #+RESULTS:
 : True
 : 8

**** Anillos de polinomios
 #+BEGIN_SRC sage
 P = QQ['x']
 P
 P2 = QQ['x','y','z']
 P2
 #+END_SRC

 #+RESULTS:
 : Univariate Polynomial Ring in x over Rational Field
 : Multivariate Polynomial Ring in x, y, z over Rational Field

*** Cuerpos finitos
#+BEGIN_SRC sage
K = GF(5)
a = K.0
a+a+a+a
K.characteristic()
#+END_SRC

#+RESULTS:
: 4
: 5

*** Producto de anillos
#+BEGIN_SRC sage
CZQ = ZZ.cartesian_product(QQ)
CZQ
CZQ.one()
#+END_SRC

#+RESULTS:
: The Cartesian product of (Integer Ring, Rational Field)
: (1, 1)

*** Ideales
#+BEGIN_SRC sage
P.<x,y> = QQ[]
I = Ideal(P,[x+y,x^2+1])
I
ZZ8 = ZZ.quotient(ZZ.ideal(8))
ZZ8 == Integers(8)
#+END_SRC

#+RESULTS:
: Ideal (x + y, x^2 + 1) of Multivariate Polynomial Ring in x, y over Rational Field
: True

**** Inclusión de ideales
 Definimos la inclusión de ideales y sobrecargamos el método de 
 orden para expresarla.
 #+BEGIN_SRC sage
   I = 2*ZZ
   J = 4*ZZ
   def contenido(I,J):
       return I+J == J

   contenido(I,J)
   contenido(J,I)
   sage.rings.ideal.Ideal_pid.__lt__=contenido
   I < J
   J > I
 #+END_SRC

 #+RESULTS:
 : False
 : True
 : False
 : True

**** Operaciones con ideales
 #+BEGIN_SRC sage
   # Suma de ideales
   4*ZZ + 6*ZZ

   # Producto de ideales
   (4*ZZ)*(6*ZZ)

   # Intersección de ideales
   def intersection(I,J):
       a = I.gen()
       b = J.gen()
       q = (a*b).quo_rem(gcd(a,b))
       return Ideal(q[0])
   sage.rings.ideal.Ideal_pid.__and__=intersection

   (4*ZZ)&(6*ZZ)

   # Cociente de ideales
   def cocienteideales(I,J):
       if not (J<I):
           raise "El cociente necesita de inclusión"
       return I.gens()*I.ring().quo(J)
   sage.rings.ideal.Ideal_pid.__div__=cocienteideales

   (2*ZZ)/(4*ZZ)

   # Operaciones con ideales
   6*ZZ/((6*ZZ)&(4*ZZ))
 #+END_SRC

 #+RESULTS:
 : Principal ideal (2) of Integer Ring
 : Principal ideal (24) of Integer Ring
 : Principal ideal (12) of Integer Ring
 : Principal ideal (2) of Ring of integers modulo 4
 : Principal ideal (6) of Ring of integers modulo 12

*** Homomorfismos de anillos
#+BEGIN_SRC sage
# Inclusión 
H = Hom(ZZ,QQ)
inc = H([1])
inc(1)

# Homomorfismo al cociente
f = ZZ.hom([1],ZZ.quo(4*ZZ))
f(1) == f(5)
f(6)

# Composición de homomorfismos
R.<x,y,z> = QQ[]
S.<t> = QQ[]
f = R.hom([t^3,t^5,t^7],S)
g = S.hom([t^2],S)
g*f
#+END_SRC

#+RESULTS:
#+begin_example
1
True
2

Ring morphism:
  From: Multivariate Polynomial Ring in x, y, z over Rational Field
  To:   Univariate Polynomial Ring in t over Rational Field
  Defn: x |--> t^6
        y |--> t^10
        z |--> t^14
#+end_example

*** Anillos de polinomios
    Para poder usar las variables del anillo de polinomios en 
    sage debemos insertarlas

#+BEGIN_SRC sage
P = PolynomialRing(QQ,['x','y','z','t'])
P.inject_variables()
x in P
#+END_SRC
#+RESULTS:
: Defining x, y, z, t
: True

*** Factorización
#+BEGIN_SRC sage
P.<x,y> = QQ[]
c = x^3-y^2
c.factor()

f = x*y-1
g = x^2+y^2-4
#+END_SRC
#+RESULTS:
: (-1) * (-x^3 + y^2)

*** Polinomios en una variable
#+BEGIN_SRC sage
R = Zmod(2)['x']
R.inject_variables()
filter(is_prime,list(R.monics(of_degree=5)))
#+END_SRC
#+RESULTS:
: Defining x
: 
: [x^5 + x^2 + 1,
:  x^5 + x^3 + 1,
:  x^5 + x^3 + x^2 + x + 1,
:  x^5 + x^4 + x^2 + x + 1,
:  x^5 + x^4 + x^3 + x + 1,
:  x^5 + x^4 + x^3 + x^2 + 1]

*** Ejemplo: Cuerpo de 256 elementos
Vamos a tomar un cuerpo de 256 elementos y vamos a multiplicar en él usando 
logaritmos. Es decir, vamos a representar cada polinomio como un número binario
y vamos a sumarlos para multiplicar.

#+BEGIN_SRC sage
p = R.irreducible_element(8)
Q = R.quo(p*R,'a')
Q.is_field()
a = Q.0

# Potencias de a, son todo elementos de Q
l = [a^i for i in range(2**8-1)]
l.index(a^2+1)
#+END_SRC
#+RESULTS:
: True
: 50

*** Órdenes monomiales
    #+BEGIN_SRC sage
      P = PolynomialRing(QQ,x,3,order='lex')
      P.inject_variables()

      ds = list(WeightedIntegerVectors(2,[1,1,1]))+list(WeightedIntegerVectors(1,[1,1,1]))
      ms=[P({tuple(l):1}) for l in ds]
      sorted(ms)

      P=PolynomialRing(QQ,x,3,order='degrevlex')
      P.inject_variables()

      ds = list(WeightedIntegerVectors(2,[1,1,1]))+list(WeightedIntegerVectors(1,[1,1,1]))
      ms=[P({tuple(l):1}) for l in ds]
      sorted(ms)
    #+END_SRC

    #+RESULTS:
    : Defining x0, x1, x2
    : [x2, x2^2, x1, x1*x2, x1^2, x0, x0*x2, x0*x1, x0^2]
    : Defining x0, x1, x2
    : [x2, x1, x0, x2^2, x1*x2, x0*x2, x1^2, x0*x1, x0^2]

**** Ejercicio
     Ordena mediante el orden lexicográfico y lexicográfico graduado todos los 
     monomios en tres variables de grado 3.

     #+BEGIN_SRC sage
       P=PolynomialRing(QQ,x,3)
       P.inject_variables()

       ds = list(WeightedIntegerVectors(3,[1,1,1]))
       ms=[P({tuple(l):1}) for l in ds]
       sorted(ms)
     #+END_SRC

     #+RESULTS:
     #+begin_example
     Defining x0, x1, x2

     [x2^3,
      x1*x2^2,
      x0*x2^2,
      x1^2*x2,
      x0*x1*x2,
      x0^2*x2,
      x1^3,
      x0*x1^2,
      x0^2*x1,
      x0^3]
     #+end_example

*** Bases de Gröbner
    #+BEGIN_SRC sage
      P = PolynomialRing(QQ, ['x','y','z'], order='lex')
      I = (x^4-y^4+z^3-1, x^3+y^2+z^2-1)*P
      len(I.groebner_basis())
    #+END_SRC

    #+RESULTS:
    : 5

*** Pertenencia de polinomios
    #+BEGIN_SRC sage
      P.<x,y>=QQ[]
      I = (x^2-y^3,x)*P
      I.groebner_basis()
      y**3 in I
    #+END_SRC

    #+RESULTS:
    : [y^3, x]
    : True

**** Ejercicio
     #+BEGIN_SRC sage
       P.<x,y,z>=QQ[]
       g1=x^2*y*z+y^2*z+1
       g2=x*y^2*z+y*z^2-2
       g3=x*y*z^2+z+3
       I = (g1,g2,g3)*P
       len(I.groebner_basis())
       P.quo(I).()
     #+END_SRC

     #+RESULTS:
     : 8
     : Rational Field

*** Cúpside
    #+BEGIN_SRC sage
      P = PolynomialRing(QQ,["t","x","y"],order="lex")
      P.inject_variables()
      I = (x-t^2,y-t^3)*P
      I.groebner_basis()
      I.elimination_ideal([t])
    #+END_SRC

    #+RESULTS:
    : Defining t, x, y
    : [t^2 - x, t*x - y, t*y - x^2, x^3 - y^2]
    : Ideal (x^3 - y^2) of Multivariate Polynomial Ring in t, x, y over Rational Field

    
**** Ejercicio
     #+BEGIN_SRC sage
       P = PolynomialRing(QQ,["t","x","y","z","u"],order="lex")
       P.inject_variables()
       I = (x-t-u, y-t^2-2*t*u, z-t^3-3*t^2*u)*P
       I.elimination_ideal([t,]u)
     #+END_SRC

     #+RESULTS:
     : Defining t, x, y, z, u
     : Ideal (4*x^3*z - 3*x^2*y^2 - 6*x*y*z + 4*y^3 + z^2) of Multivariate Polynomial Ring in t, x, y, z, u over Rational Field

